-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: udon
-- ------------------------------------------------------
-- Server version	8.0.23-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_post_comment`
--

DROP TABLE IF EXISTS `user_post_comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_post_comment` (
  `comment_id` int NOT NULL AUTO_INCREMENT,
  `post_id` int NOT NULL,
  `user_id` varchar(20) NOT NULL,
  `comm_content` varchar(500) DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `comm_like_count` int DEFAULT '0',
  PRIMARY KEY (`comment_id`),
  KEY `FK_user_post_TO_user_post_comment_1` (`post_id`),
  KEY `FK_user_TO_user_post_comment_1` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=133 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_post_comment`
--

LOCK TABLES `user_post_comment` WRITE;
/*!40000 ALTER TABLE `user_post_comment` DISABLE KEYS */;
INSERT INTO `user_post_comment` VALUES (33,85,'ssafy1','오올 여기 저도 어제 갔었는데 너무 맛있어요 ㅠㅠㅠ','2021-02-18 01:23:00',2),(34,83,'ssafy1','혹시 폰 뭐쓰시나요??','2021-02-18 01:23:12',0),(35,82,'ssafy1','저도 조만간 꼭 가봐야겠어요 ㅠㅠㅠ','2021-02-18 01:23:21',0),(36,87,'ssafy1','조오로로로롤맛! 추천합니다!','2021-02-18 01:29:29',1),(37,86,'ssafy1','새벽감성쓰..','2021-02-18 01:47:38',1),(38,89,'ssafy1111','맛있겠네요','2021-02-18 09:50:01',1),(39,89,'ssafy1','ㅋㅋㅋㅋ존맛!','2021-02-18 10:01:01',0),(40,85,'ssafy1111','12번출구 어디쪽에 있나요??','2021-02-18 10:01:17',0),(41,89,'ssafy1111','','2021-02-18 11:12:27',0),(42,88,'ssafy1111','','2021-02-18 11:12:42',0),(43,95,'aceace','안녕하세요! 새로 이사오셨나봐요 가입인사라니...','2021-02-18 13:26:57',1),(44,95,'ssafy1111','반갑읍니다','2021-02-18 13:27:11',0),(45,89,'aceace','저거 어디 만두인가요?','2021-02-18 13:27:22',0),(46,88,'aceace','오올.. 새마을식당 연탄불고기는 먹어봤는데 막창도 맛있나보네요~!!','2021-02-18 13:28:33',0),(47,86,'aceace','우동소바님 감성에 눈물을 젖고 갑니다','2021-02-18 13:28:47',0),(48,89,'ssafy1','북촌왕만두입니다!','2021-02-18 13:34:57',0),(49,86,'ssafy1','댓글에 한 줄해서 더 보기 기능이 있으면 좋을 거 같아요!','2021-02-18 13:38:42',0),(50,101,'ssafy1111','와 부러워요','2021-02-18 14:40:05',0),(52,102,'ssafy1111','모두가 매수 볼 때 혼자 매도치는 undefind 없제?','2021-02-18 14:41:28',0),(54,102,'gyuyong','영차영차','2021-02-18 14:45:57',0),(55,101,'gyuyong','헉 여긴 어딘가요??','2021-02-18 14:46:05',0),(56,100,'gyuyong','멋진 사진이에요~','2021-02-18 14:46:23',0),(57,97,'gyuyong','안녕하세요~','2021-02-18 14:46:48',0),(58,103,'aceace','왜 사진이 스테이크만 피해간걸까요...?','2021-02-18 14:47:54',0),(59,107,'gyuyong','미쳤다.... 미쳤다!!!!! 어디 거예요?!?!','2021-02-18 14:48:39',1),(60,107,'gyuyong','노른자 빛깔...핡','2021-02-18 14:48:55',0),(61,109,'aceace','와 위험해보이네요 ㅠㅠㅠ 민원 넣어놔야겠어요','2021-02-18 14:53:28',0),(62,107,'aceace','여기! 순이네빈대떡입니다!','2021-02-18 14:54:04',0),(63,105,'aceace','오늘도 개발에 찌들어... 커피로 수혈받습니다...','2021-02-18 14:54:40',0),(64,110,'aaaaaa','싫어요는 없나요? 멘트나 주접스럽네요','2021-02-18 14:59:22',1),(65,109,'aaaaaa','제가 아까 주민센터에 연락넣었어요! 내일 안에 담당부서에서 조치할 수 있도록 하겠다고 하시네요.','2021-02-18 15:00:12',0),(66,108,'aaaaaa','제 친구 중에 estj는 다 인싸들이단데','2021-02-18 15:00:36',0),(67,107,'aaaaaa','ㅋㅋㅋㅋㅋㅋㅋ역시 육회에는 막걸리 한사발이죠','2021-02-18 15:01:01',0),(68,107,'aaaaaa','이통일반이 진리입니다!','2021-02-18 15:01:11',0),(69,106,'aaaaaa','이번 상반기에 싸피5기들 수료 아닌가요?','2021-02-18 15:01:54',0),(70,106,'aaaaaa','이번에 저희 팀에 싸피 출신들어왔는데 협업능력도 좋고 애자일하게 프로젝트도 잘하고 실력이 좋긴하더라구요','2021-02-18 15:02:29',0),(71,105,'aaaaaa','아메리카노~ 좋아좋아졸아! ㅆ썹썹썹썹','2021-02-18 15:02:48',0),(72,104,'aaaaaa','올해 백신접종까지 너무 힘들었네요.. 다들 2022년도 새해복 많이 받으세요!','2021-02-18 15:03:23',0),(73,103,'aaaaaa','선인장 모양 스테이크 인가요? 저것도 엄청난 재주시네요','2021-02-18 15:03:41',0),(74,102,'aaaaaa','한국도 이제 유동성효과 끝물입니다 이제 베트남 중국으로 가셔야합니다','2021-02-18 15:04:08',0),(75,101,'aaaaaa','여기 예전에 소개팅하러 갔었는데 너무 맛있아서 소개팅은 망치고 밥만 맛있게먹고왔어요 ㅋㅋㅋㅋㅋㅋㅋ','2021-02-18 15:04:38',0),(76,100,'aaaaaa','#갬성쓰 #아이폰','2021-02-18 15:04:52',0),(77,99,'aaaaaa','저거 약간 서울보다는 부산으낌인거같건게 시원한향','2021-02-18 15:05:13',0),(78,97,'aaaaaa','안녕하세요 저도 예전에 바이엘 쳤었는데 잘부탁드려요!!','2021-02-18 15:05:44',0),(79,95,'aaaaaa','반갑읍니다니 혹시 이북 출신이신가요??','2021-02-18 15:06:07',0),(80,94,'aaaaaa','멀탬 밥 맛있아요<~~~~!!!','2021-02-18 15:06:26',0),(81,93,'aaaaaa','안녕만두 방가뤄망두','2021-02-18 15:06:38',0),(82,92,'aaaaaa','내일모레는 이제 날 풀린다네교 ㅠㅠㅠ','2021-02-18 15:06:52',0),(83,92,'aaaaaa','그래도 봄 오면 또 황사일텐데 ㅠㅠㅠ','2021-02-18 15:07:02',0),(84,91,'aaaaaa','#빠이','2021-02-18 15:07:31',0),(85,112,'aaaaaa','쉽게 보일지 모르겠지만 1천점이상 아무나 하는거 아닙니다...!','2021-02-18 15:11:06',0),(86,114,'ssafy1','작년에 석촌호수도 막고 해서 보러갈곳이 없었는데 ㅠㅠㅠ','2021-02-18 15:14:59',0),(87,114,'ssafy1','혹시 역삼동 주변에 벚꽃 명소 있나요?','2021-02-18 15:15:09',0),(88,113,'ssafy1','가운데 빨간색 옷 입으신분이 잘생기시고 눈에 띄네요','2021-02-18 15:15:30',0),(89,112,'ssafy1','전 3판만에 1500점 ㅋ','2021-02-18 15:15:45',0),(90,111,'ssafy1','혹시 그래서 닉이 월급루팡이신가요?','2021-02-18 15:16:01',0),(91,110,'ssafy1','ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ','2021-02-18 15:16:13',1),(92,105,'ssafy1','오늘의 일본어! 커피는 코-히-','2021-02-18 15:16:45',0),(93,104,'ssafy1','.........???','2021-02-18 15:16:55',0),(94,102,'ssafy1','수익금액 인증한번하시져','2021-02-18 15:17:26',0),(95,116,'aceace','ㅋㅋㅋㅋㅋㅋ동네 소식 많이 올려주세요','2021-02-18 15:25:22',1),(96,116,'ssafy1111','우동소바님 감사합니다(__)','2021-02-18 15:26:09',2),(97,115,'ssafy1111','와  진짜 유명한곳이잖아요','2021-02-18 15:26:26',1),(98,111,'aaaaaa','ㅋㅋㅋㅋㅋ워너비.. 회사에서는 열심히 일하고 있습니다','2021-02-18 15:26:29',0),(99,116,'aaaaaa','우동 대.박.나.자!!!!','2021-02-18 15:28:40',1),(100,115,'aaaaaa','ㅋㅋㅋㅋㅋㅋㅋㅋ오오 유명한 곳인가 보네요.. 전 처음 들어보는데 가봐야겠어요~!','2021-02-18 15:29:04',0),(101,114,'aaaaaa','역삼동은 벚꽃 구경하기는 정말 어렵죠 ㅠㅠㅠ','2021-02-18 15:29:44',0),(102,114,'aaaaaa','차라리 아스팔트 위에 심는게 더 빠를것 같아요','2021-02-18 15:29:53',0),(103,112,'aaaaaa','ㅋㅋㅋㅋㅋㅋ','2021-02-18 15:30:08',0),(104,112,'aaaaaa','조만간 1500점 깨서 인증하겠습니다','2021-02-18 15:30:16',0),(105,120,'ssafy1111','날씨 넘 좋죠~~','2021-02-18 17:38:12',1),(106,110,'aceace','진짜 맛있어요!!','2021-02-18 17:38:27',0),(107,120,'yong1','맞아요 날씨가 너무좋아요!!','2021-02-18 18:02:00',1),(108,118,'yong1','맞아요 장사 너무 힘든것같아요 ㅜㅜ','2021-02-18 18:02:49',0),(109,121,'yong1','ㅋㅋㅋㅋㅋㅋ보근님 아니됩니다','2021-02-18 20:03:11',0),(110,122,'jeh123','은혜누구꺼야','2021-02-18 21:42:37',0),(111,122,'yong1','ㅋㅋㅋㅋㅋ','2021-02-18 21:42:54',0),(112,122,'jeh123','나 누구꺼야','2021-02-18 21:43:12',1),(113,121,'ssafy1','ㅋㅋㅋㅋㅋㅋㅋㅋ??','2021-02-19 00:19:11',0),(114,118,'ssafy1','와.. 지금 가면 혼자서 전세낼 수 있겠네요..!','2021-02-19 00:19:40',0),(115,124,'yong1','안녕하세요 어서에요 ㅎㅎ 환영해요','2021-02-19 02:10:35',0),(116,127,'aceace','와 너무 예쁘네요 .>>! 근데 직접 찍으신게 맞나요?','2021-02-19 02:43:06',1),(117,126,'bulgen','사진이 혹시 1980년대에 찍으신건가요?','2021-02-19 10:10:49',0),(118,128,'bulgen','ㅋㅋㅋㅋㅋㅋ안녕하세요','2021-02-19 10:11:17',0),(119,114,'bulgen','와 벚꽃...','2021-02-19 10:11:39',0),(120,110,'bulgen','ㅋㅋㅋㅋㅋㅋㅋ고추 바사삭 맛있어요','2021-02-19 10:12:06',0),(121,129,'ssafy1','오오 혹시 아직도 하고있을까요 ? ㅠㅠㅠㅠ','2021-02-19 11:50:40',0),(122,127,'ssafy1','와 예쁘네요! GS본사 건물 근처 맞나요?','2021-02-19 11:51:18',0),(123,127,'ssafy1','저도 오늘 점심시간에 하늘보러 잠시 나가봐야겠어요!','2021-02-19 11:51:27',1),(124,126,'ssafy1','여기 혹시 얼마전에 폐업했지 않나요....? 코로나 나쁘시끼 ㅠㅠ','2021-02-19 11:51:54',0),(125,121,'ssafy1','ㅋㅋㅋㅋㅋ용욱이 외동아닌가여?','2021-02-19 11:52:20',0),(126,120,'ssafy1','바람불면 조금 추운거 빼고는 너무 날시 좋네요! 한강 놀러가고 싶네요~','2021-02-19 11:52:55',0),(127,114,'aceace','벚꽃예쁘다!','2021-02-19 13:56:55',0),(128,114,'aceace','와웅','2021-02-19 13:57:26',0),(129,111,'aceace','ㅁㄴ','2021-02-19 13:57:32',0),(130,108,'aceace','ESTJ혹시 역삼동에 있으신가요??','2021-02-19 13:57:35',0),(131,108,'aceace','지도자형?','2021-02-19 13:57:44',0),(132,124,'gyuyong','','2021-02-19 14:09:24',0);
/*!40000 ALTER TABLE `user_post_comment` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-02-25 16:03:41
