-- MySQL dump 10.13  Distrib 8.0.22, for Win64 (x86_64)
--
-- Host: localhost    Database: udon
-- ------------------------------------------------------
-- Server version	8.0.23-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `user_post`
--

DROP TABLE IF EXISTS `user_post`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_post` (
  `post_id` int NOT NULL AUTO_INCREMENT,
  `user_id` varchar(20) NOT NULL,
  `post_content` varchar(500) DEFAULT NULL,
  `post_views` int DEFAULT '0',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `is_open` varchar(10) DEFAULT '0',
  `post_like_count` int DEFAULT '0',
  `post_tag` varchar(100) DEFAULT NULL,
  `is_updated` int DEFAULT '0',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `post_comment_count` int DEFAULT '0',
  `area_code` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`post_id`),
  KEY `FK_user_TO_user_post_1` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=131 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_post`
--

LOCK TABLES `user_post` WRITE;
/*!40000 ALTER TABLE `user_post` DISABLE KEYS */;
INSERT INTO `user_post` VALUES (82,'aceace','오늘 투썸 신메뉴 상그리아 에이드 먹어봤는데 맛있어요~~~! 추천추천! (단, 계피맛 싫어하시면 불호일듯) #투썸 #상그리아에이드',107,'2021-02-18 00:15:01','badge1',2,'#투썸#상그리아에이드',0,'2021-02-18 00:15:01',0,'1168065000'),(83,'aceace','오늘자 하늘!',100,'2021-02-18 00:17:52','badge1',2,'',0,'2021-02-18 00:17:52',0,'1168065000'),(85,'aceace','오늘 역삼역 12번출구에서 붕신 영접함!!! #붕어빵 #존맛',151,'2021-02-18 00:35:43','badge1',2,'#붕어빵#존맛',0,'2021-02-18 00:35:43',0,'1168065000'),(86,'ssafy1','ㄱr끔씩 혼자라고 생각될때, 그것은 정말 아름다운 때일 수도 있다.. #갬성 #새벽 #생각',173,'2021-02-18 01:22:34','badge2',2,'#갬성#새벽#생각',0,'2021-02-18 01:22:34',0,'1168065000'),(88,'ssafy1','오늘 먹은 저녁 자랑하기! 새마을식당 막창 진짜 졸맛이예요!! #막창',155,'2021-02-18 01:46:19','badge2',1,'#막창',0,'2021-02-18 01:46:19',0,'1168065000'),(89,'ssafy1','야식으로 친구랑 차에서 만두 먹기 #만두',176,'2021-02-18 01:46:45','badge2',2,'#만두',0,'2021-02-18 01:46:45',0,'1168065000'),(90,'aceace','오늘 너무너무 춥다.. 만두가 땡긴다..',86,'2021-02-18 11:20:33','badge1',0,'',0,'2021-02-18 11:20:33',0,'1168065000'),(91,'yong1','내피드에 작성하는 글 ',78,'2021-02-18 11:23:28','badge2',0,'',0,'2021-02-18 11:23:28',0,'1168065000'),(92,'ssafy1','오늘도 춥지만 모두 화이팅합시다~!!!',120,'2021-02-18 11:25:27','badge2',2,'',0,'2021-02-18 11:25:27',0,'1168065000'),(93,'yong1','역삼동사람들 아룡하세여~~~~~~~~~~#만두',126,'2021-02-18 11:25:30','badge2',3,'#만두',0,'2021-02-18 11:25:30',0,'1168065000'),(94,'yong1','역삼동 멀티캠퍼스 굿굿 ',107,'2021-02-18 11:43:14','badge2',3,'',0,'2021-02-18 11:43:14',0,'1168065000'),(95,'ssafy1111','다들 안녕하세요 가입 인사드립니다~!',138,'2021-02-18 11:56:58','badge1',3,'',0,'2021-02-18 11:56:58',0,'1168065000'),(96,'yong1','안녕하세요 저의집 개입니다.',109,'2021-02-18 12:53:36','badge1',0,'',0,'2021-02-18 12:53:36',0,'1168065000'),(97,'aceace','안녕하세요 32살 피아니스트입니다~!',61,'2021-02-18 13:56:54','badge2',1,'',0,'2021-02-18 13:56:54',0,'1168065000'),(99,'ssafy1','이거 향수 써보신분 있나요? H&M Seoul이라는 향수인데 궁금하네용',59,'2021-02-18 14:20:30','badge1',0,'',0,'2021-02-18 14:20:30',0,'1168065000'),(100,'ssafy1','#하늘 #감상',54,'2021-02-18 14:27:21','badge1',2,'#하늘#감상',0,'2021-02-18 14:27:21',0,'1168065000'),(101,'ssafy1','친구들과 함께한 고급스러운 저녁식사 맛있는 것들이 너무 많았다 #스테이크 #랍스터 #강남',54,'2021-02-18 14:28:45','badge1',3,'#스테이크#랍스터#강남',0,'2021-02-18 14:28:45',0,'1168065000'),(102,'aceace','요새 다들 주식으로 먹고 사시는거 맞죠? 동학개미 가즈아~~~~! #주식',26,'2021-02-18 14:40:19','badge2',2,'#주식',0,'2021-02-18 14:40:19',0,'1168065000'),(103,'aceace','오늘 만든 스테이크~~! 조오오오올맛!!',33,'2021-02-18 14:41:54','badge2',1,'',0,'2021-02-18 14:41:54',0,'1168065000'),(104,'aceace','모두 메리크리스마스~~~~~!!!',31,'2021-02-18 14:43:35','badge2',2,'',0,'2021-02-18 14:43:35',0,'1168065000'),(105,'gyuyong','커피마시기 딱 좋은 날씨네요!\n졸린 오후 커피 한 잔씩 하면서 힘내봅시다@.@',23,'2021-02-18 14:45:27','badge4',3,'',0,'2021-02-18 14:45:27',0,'1168065000'),(106,'aceace','싸피 한국경제신문에 기사 났네요!! 금융권에서 진짜 인재라고 좋아한다고 ㅠㅠㅠㅠ 다들 상반기 취뽀하길?',52,'2021-02-18 14:45:27','badge2',2,'',0,'2021-02-18 14:45:27',0,'1168065000'),(107,'aceace','쏴리지리어~~~~~~엇!!! #육회',49,'2021-02-18 14:46:20','badge2',3,'#육회',0,'2021-02-18 14:46:20',0,'1168065000'),(108,'aceace','하이 얘들아 내가 누군지 아니? 이에스티제이! 이에스티제이!',39,'2021-02-18 14:50:10','badge2',1,'',0,'2021-02-18 14:50:10',0,'1168065000'),(109,'ssafy1111','2번출구 앞에 보도블럭 조심하세요',39,'2021-02-18 14:51:38','badge3',4,'',0,'2021-02-18 14:51:38',0,'1168065000'),(110,'aceace','굽네 고추 바사삭 아니 이건 진짜 치킨이 아닌데??? 그냥 입에서 녹아요 만드신분이 솜사탕 뿌려주시는 하늘나라 선녀님인듯',38,'2021-02-18 14:55:53','badge2',4,'',0,'2021-02-18 14:55:53',0,'1168065000'),(111,'aaaaaa','하... 그냥 건물주하고 살고싶다...',38,'2021-02-18 14:58:48','badge1',2,'',0,'2021-02-18 14:58:48',0,'1168065000'),(112,'aaaaaa','수박게임 해보신분 있나요? 중독성 진짜 쩔어요 ㅋㅋㅋㅋㅋㅋ github에 코드도 있어요',57,'2021-02-18 15:10:49','badge1',2,'',0,'2021-02-18 15:10:49',0,'1168065000'),(114,'aaaaaa','빨리 4월되어서 벚꽃보고싶다!!!? #벚꽃',90,'2021-02-18 15:13:54','badge1',3,'#벚꽃',0,'2021-02-18 15:13:54',0,'1168065000'),(115,'ssafy1','일본에서 유명한 팬케이크 집인데 조만간 한국은행 건물 근처에 오픈한다네요!! 예전에 오시카 갔을때 먹어봤는데 진짜 맛있음... 특히 메이플 시럽이... ',142,'2021-02-18 15:19:35','badge1',2,'',0,'2021-02-18 15:19:35',0,'1168065000'),(116,'ssafy1','요새 코로나때문에 동네 근처에서 안 벗어나게 되네요~ 덕분에 우동에서 공유하고 싶은 것들이 많아지는거같아요 ㅎㅎㅎ #우동',150,'2021-02-18 15:21:21','badge1',2,'#우동',0,'2021-02-18 15:21:21',0,'1168065000'),(118,'ssafy1111','pc방사장인데요\n요즘 장사하기 너무 힘드네요..',144,'2021-02-18 16:15:17','badge3',1,'',0,'2021-02-18 16:15:17',0,'1168065000'),(120,'aceace','안녕하세요! 오늘 날씨가 너무 좋네요!!',135,'2021-02-18 17:30:01','badge2',2,'',0,'2021-02-18 17:30:01',0,'1168065000'),(121,'rkdqhrms4','용욱이오빠  여동생입니다 알라뷰 ',101,'2021-02-18 20:02:55','badge1',2,'',0,'2021-02-18 20:02:55',0,'1168065000'),(123,'yong1','내일 춥다고합니다!!!!!!!!!! 다들 따시게입으세요',71,'2021-02-19 02:03:10','badge1',0,'',0,'2021-02-19 02:03:10',0,'1168065000'),(124,'zenohero','안뇽하세요~ 오늘 가입했어요 <br>',85,'2021-02-19 02:10:16','badge1',1,'',0,'2021-02-19 02:10:16',0,'1168065000'),(126,'aeaeaeae','역삼동 맛집 추천드립니다!! ',75,'2021-02-19 02:17:00','badge1',2,'',0,'2021-02-19 02:17:00',0,'1168065000'),(127,'aeaeaeae','오늘 찍은 구름 사진이에요 하늘이 너무 이뻐요~~',71,'2021-02-19 02:20:10','badge1',5,'',0,'2021-02-19 02:20:10',0,'1168065000'),(128,'lastday','아침인사 올립니다!!!',57,'2021-02-19 09:58:34','badge1',0,'',0,'2021-02-19 09:58:34',0,'1168065000'),(129,'bulgen','지금 역삼역 2번 출구에서 몬스터 에너지 드링크 신제품 무료로 나눠주고 있어요!!<br><br>주변에 계신분들 가서 겟 하세요~~!!',22,'2021-02-19 10:23:22','badge1',3,'',0,'2021-02-19 10:23:22',0,'1168065000'),(130,'gyuyong','',4,'2021-02-19 14:09:38','badge1',1,'',0,'2021-02-19 14:09:38',0,'1168065000');
/*!40000 ALTER TABLE `user_post` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-02-25 16:03:05
